---
type: Wood
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# Wood

`Autodesk.Revit.DB.Visual.Wood` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TextureAngle | 2018.1 | `public static string TextureAngle { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldOffsetZ | 2018.1 | `public static string TextureRealWorldOffsetZ { get ; }` |
| Property | WoodAxialNoise | 2018.1 | `public static string WoodAxialNoise { get ; }` |
| Property | WoodColor1 | 2018.1 | `public static string WoodColor1 { get ; }` |
| Property | WoodColor2 | 2018.1 | `public static string WoodColor2 { get ; }` |
| Property | WoodRadialNoise | 2018.1 | `public static string WoodRadialNoise { get ; }` |
| Property | WoodThickness | 2018.1 | `public static string WoodThickness { get ; }` |